Revit 2026 API

# ElementArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ElementArrayIterator()
```
```fsharp
new : unit -> ElementArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ElementArrayIterator Class

Autodesk.Revit.DB Namespace